#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.ec2.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.ec2.data.aws_ssm_parameter.this[0]: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mmodule.ec2.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.ec2.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.ec2.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602][0m
[0m[1mmodule.ec2.data.aws_ssm_parameter.this[0]: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 1s [id=us-east-1][0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...[0m[0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...[0m[0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...[0m[0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914][0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 1s [id=874300523][0m
[0m[1mmodule.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 1s [id=1315226949][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.ec2.aws_iam_instance_profile.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "this" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = (known after apply)
      [32m+[0m[0m name_prefix = "iac-ci-cd-terraform-"
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = (known after apply)
      [32m+[0m[0m tags        = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.ec2.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = "EC2AssumeRole"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m description           = "IAM role for EC2 instance"
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = "iac-ci-cd-terraform-"
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.ec2.aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.ec2.aws_instance.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m[0m ami                                  = "ami-0cf43e890af9e3351"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = (known after apply)
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m volume_tags                          = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m credit_specification {}

      [32m+[0m[0m enclave_options {
          [32m+[0m[0m enabled = (known after apply)
        }

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 1
          [32m+[0m[0m http_tokens                 = "optional"
          [32m+[0m[0m instance_metadata_tags      = (known after apply)
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.security_group_instance.aws_security_group.this_name_prefix[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this_name_prefix" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security Group for EC2 Instance Egress"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "iac-ci-cd-terraform-ec2-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.security_group_instance.aws_security_group_rule.egress_rules[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "HTTPS"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.vpc.aws_default_network_acl.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_network_acl" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_network_acl_id = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m egress {
          [32m+[0m[0m action          = "allow"
          [32m+[0m[0m from_port       = 0
          [32m+[0m[0m ipv6_cidr_block = "::/0"
          [32m+[0m[0m protocol        = "-1"
          [32m+[0m[0m rule_no         = 101
          [32m+[0m[0m to_port         = 0
        }
      [32m+[0m[0m egress {
          [32m+[0m[0m action     = "allow"
          [32m+[0m[0m cidr_block = "0.0.0.0/0"
          [32m+[0m[0m from_port  = 0
          [32m+[0m[0m protocol   = "-1"
          [32m+[0m[0m rule_no    = 100
          [32m+[0m[0m to_port    = 0
        }

      [32m+[0m[0m ingress {
          [32m+[0m[0m action          = "allow"
          [32m+[0m[0m from_port       = 0
          [32m+[0m[0m ipv6_cidr_block = "::/0"
          [32m+[0m[0m protocol        = "-1"
          [32m+[0m[0m rule_no         = 101
          [32m+[0m[0m to_port         = 0
        }
      [32m+[0m[0m ingress {
          [32m+[0m[0m action     = "allow"
          [32m+[0m[0m cidr_block = "0.0.0.0/0"
          [32m+[0m[0m from_port  = 0
          [32m+[0m[0m protocol   = "-1"
          [32m+[0m[0m rule_no    = 100
          [32m+[0m[0m to_port    = 0
        }
    }

[1m  # module.vpc.aws_default_route_table.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_route_table" "default" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_route_table_id = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m route                  = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "5m"
          [32m+[0m[0m update = "5m"
        }
    }

[1m  # module.vpc.aws_default_security_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_security_group" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = (known after apply)
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.vpc.aws_route_table.intra[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "intra" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.vpc.aws_route_table_association.intra[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "intra" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.vpc.aws_route_table_association.intra[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "intra" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.vpc.aws_route_table_association.intra[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "intra" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.vpc.aws_subnet.intra[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "intra" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.0.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.vpc.aws_subnet.intra[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "intra" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.vpc.aws_subnet.intra[2][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "intra" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.vpc.aws_vpc.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "this" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
    }

[1m  # module.vpc_endpoints.aws_security_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "VPC endpoint security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "iac-ci-cd-terraform-vpc-endpoints-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform-vpc-endpoints-"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform-vpc-endpoints-"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.vpc_endpoints.aws_security_group_rule.this["ingress_https"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "this" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "10.0.0.0/24",
          [32m+[0m[0m "10.0.1.0/24",
          [32m+[0m[0m "10.0.2.0/24",
        ]
      [32m+[0m[0m description              = "HTTPS from subnets"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.vpc_endpoints.aws_vpc_endpoint.this["ec2messages"][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = true
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.ec2messages"
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform-ec2messages"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform-ec2messages"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Interface"
      [32m+[0m[0m vpc_id                = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "10m"
          [32m+[0m[0m update = "10m"
        }
    }

[1m  # module.vpc_endpoints.aws_vpc_endpoint.this["ssm"][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = true
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.ssm"
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform-ssm"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform-ssm"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Interface"
      [32m+[0m[0m vpc_id                = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "10m"
          [32m+[0m[0m update = "10m"
        }
    }

[1m  # module.vpc_endpoints.aws_vpc_endpoint.this["ssmmessages"][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = true
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.ssmmessages"
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "iac-ci-cd-terraform-ssmmessages"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "CI"         = "true"
          [32m+[0m[0m "Name"       = "iac-ci-cd-terraform-ssmmessages"
          [32m+[0m[0m "Project"    = "iac-ci-cd"
          [32m+[0m[0m "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          [32m+[0m[0m "Terraform"  = "true"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Interface"
      [32m+[0m[0m vpc_id                = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "10m"
          [32m+[0m[0m update = "10m"
        }
    }

[1mPlan:[0m 22 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @melquiadesrodrigues, Action: `pull_request`, Working Directory: ``, Workflow: `ci-change terraform`*